const arr = [1, 2, 3, 4, 5];

// создай новый массив, содержащий только нечётные элементы массива arr и выведи его в консоль
// используй цикл for..i

// создай новый массив, содержащий только нечётные элементы массива arr и выведи его в консоль
// используй цикл for..of

// создай новый массив, содержащий только нечётные элементы массива arr и выведи его в консоль
// используй метод forEach()

// создай новый массив, содержащий только нечётные элементы массива arr и выведи его в консоль
// используй метод filter()
